Autodesk.Revit.DB.GeometryConversionTarget
Since:
2022
Specifies the desired type to create when importing geometry.
Since:
2022

Autodesk.Revit.DB.GeometryConversionTarget.Point
Specifies creation of a Point from the external geometry.

Autodesk.Revit.DB.GeometryConversionTarget.Curve
Specifies creation of a Curve from the external geometry.